In [3]:
import pandas as pd

<b>1. Load .xlsx file to a pandas DataFrame</b>

In [4]:
df = pd.read_excel('igrzyska.xlsx', sheet_name='t201223CRC')
df.head()

,URODZONY,PLEC,KLM6,woj,q9,q10,q11,q12,q13,q14,...,q153,q154,q155,q156,r7s1,r7s2,r7s3,r7s4,r7s5,waga
0,1940,2,1,11,2,4,NaN,13,8.0,1,...,2.0,2,NaN,2,2012,7,4,18,42,0.722004
1,1943,1,3,11,8,4,NaN,13,3.0,1,...,NaN,2,NaN,2,2012,7,4,16,43,0.686766
2,1936,1,3,11,8,4,NaN,13,3.0,1,...,NaN,2,NaN,1,2012,7,4,18,16,0.686766
3,1948,1,3,11,4,4,NaN,13,6.0,1,...,2.0,2,NaN,2,2012,7,4,19,43,1.604806
4,1994,2,1,10,3,4,NaN,11,11.0,2,...,NaN,1,2.0,1,2012,7,5,11,17,1.316088

<b>2. Create new column named 'error' containing prediction error between q93 column value and real number of golden medals acquired by Poland on the 2012 Olympic Games</b>

In [17]:
print('Number of values in column: \t {0}'.format(df['q93'].count()))
print('Number of NaN values in q93 column: \t {0}'.format(df['q93'].isna().sum()))

Number of values in column: 	 692
Number of NaN values in q93 column: 	 268